from random import randint #модуль необходим для работы со случайными числами

#выбор сложности
#количество попыток
#добавить проверку на верный ввод

print("Выбери сложность:")
dif = input()
if dif == '1':
    k = 3
    r = randint(1, 10)
    text = "Введи число от 1 до 10: "
    print("Вы выбрали легкую сложность, у вас 3 попытки")
elif dif == '2':
    pass#заглушка
    
    

while True:
    a = int(input(text))
    if r == a:
        print("Вы победили!")
        break#остановить цикл
    elif r > a:
        print("Загаданное число больше")
        
    else:
        print("Загаданное число меньше")
        

