#+-*/ арифметические операции
print(a**b)#степень 2**3=8
print(a//b)#деление нацело 10//3 = 3
print(a%b)#остаток от деления  10 % 3 = 1   7 % 5 = 2 
print(a%10)#последняя цифра числа 17 % 10 = 7
print(a//10)#отбросить последнюю цифру числа 17 // 10 = 1

#Ввод
a = input()#str - текст
b = int(input())#целые числа
c = float(input())#действительные числа

#можно исользовать _ для записи больших чисел
a = 1_244_353_352

#Длина строки
a = "Привет"
print(len(a))#6 


#Встроенные функции
print(max(45,12,1)) #максимальное - 45
print(min(45,12,1)) #минимальное - 1
print(abs(45)) #модуль   |45|= abs(45)
print(abs(-45)) #модуль   45
print(sum(1,2,3)) #сумма   6

#int
print(int("543"))#543
print(int(56.2))#56


#Получить первую цифру дробной части 47.21 -> 2
#47.21->472.1->472->2

#получить дробную часть числа 47.21 -> 0.21
#47.21-47





