#числовые типы данных
a = int(input())
b = float(input())
#строки
a = input()
a = str(b) #преобразовать к строке
#умножение строк
a = "**"
print(a*3)#******
#сложение строк
b = "-"
c = 7
print(a+b*2+str(c))#**--7

#длина строки
a = "Привет"
print(len(a))#6

#проверка длину строки
a = "Привет"
if len(a) > 5:
    print("больше 5")

#in
mail = "index3@mail.ru"
if "@" in mail:#@ находится в строке
    print("ОК")


#модуль math
from math import *#подключение модуля

num1 = sqrt(2)     # вычисление квадратного корня из двух
num2 = ceil(3.8)   # округление числа вверх 4
num3 = floor(7.3)  # округление числа вниз 7


print(num1, num2, num3, pi)

r = d*pi/180 #преобразование градусов в радианы

