#str строка (любой текст)
#int целые числа (-2,-1,0,1..)
a = int(input())
b = int(input())
print(a+b)

#+-*/ арифметические операции
print(a**b)#степень
print(2**3)
print(a//b)#деление нацело 10//3 = 3 17//5=3
print(a%b)#остаток от деления  10 % 3 = 1   7 % 5 = 2 17%5=2 15%5=0
print(a%10)#последняя цифра числа 17 % 10 = 7
print(a//10)#отбросить последнюю цифру числа 17 // 10 = 1


print(173//10)#17
print(173%10)#3

#делим пирожки
a = int(input())#пирожки
n = int(input())#внуки
print(a//n)
print(a%n)


#изменение переменных
x=3
y=5
x=x+2#x=5
y=x+y#y5+5=10
y=x*2#10
print(x,y)#5,10

#Следующее и предыдущее 🔢
a = int(input())
print("Следующее за числом", a, "число:", a+1)




















    






