print(a%10)#последняя цифра
print(a//10)#отбросить последнюю цифру

#int целые числа (-3,0,234)
#str символы буквы текст ("2!sdfsdgвавар ")
#float дробные числа (3.0, 2.53545)

# >,<,>=,<=,==, !=
a = int(input())
b = int(input())
if a>b:
    print("Больше a")
elif b > a:
    print("Больше b")
else:
    print("Равны")
 

#правильный пароль
pas = input()
if pas == "12345":
    print("Пароль правильный")
else:
    print("Ошибка!")

#кратность чисел
a = int(int(input())
if a%5==0:
    print("Кратно 5")
else:
    print("Не кратно 5")


#арифметическая прогр. 3 5 7
if a2-a1==a3-a1:
    











